tap "blacktop/tap"
tap "candid82/brew"
tap "domt4/vintage"
tap "finestructure/hummingbird"
tap "git-chglog/git-chglog"
tap "goles/battery"
tap "hazcod/hazcod"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/livecheck"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "jakewmeyer/geo"
tap "koekeishiya/formulae"
tap "mananapr/cfiles"
tap "metrumresearchgroup/tap"
tap "miserlou/loop", "https://github.com/Miserlou/Loop.git", pin: true
tap "mxcl/made"
tap "nickolasburr/pfa"
tap "sethrfore/r-srf"
tap "srkomodo/tap"
tap "vapor/tap"
tap "vitorgalvao/tiny-scripts"
tap "woodruffw/screenfetch-c"
tap "yqrashawn/goku"
# Search tool like grep, but optimized for programmers
brew "ack"
# The fastest shell plugin manager
brew "antibody"
# Collection of portable C++ source libraries
brew "boost"
# GNU compiler collection
brew "gcc"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Optimized BLAS library
brew "openblas"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Graphical system information display for macOS
brew "archey"
# C library implementing the SSH2 protocol
brew "libssh2"
# Download with resuming and segmented downloading
brew "aria2"
# Formatter/translator for text files to numerous formats. Includes a2x
brew "asciidoc"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Light UNIX download accelerator
brew "axel"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.1+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line benchmark tool
brew "bench"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Console-based live network and disk I/O bandwidth monitor
brew "bwm-ng"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Portable Foreign Function Interface library
brew "libffi"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Object-file caching compiler wrapper
brew "ccache"
# Like cat but displays content with syntax highlighting
brew "ccat"
# SSL/TLS cryptography library
brew "openssl"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Search for files matching a regex and delete them
brew "clean"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Interactive terminal based UI application for tracking cryptocurrencies
brew "cointop"
# Wrapper around make to colorize the output
brew "colormake"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# POSIX-compliant descendant of NetBSD's ash (the Almquist SHell)
brew "dash"
# DuckDuckGo from the terminal
brew "ddgr"
# Display user-friendly message boxes from shell scripts
brew "dialog"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Friendly and expressive shell
brew "elvish"
# Emoji on the command-line :scream:
brew "emojify"
# Modern replacement for 'ls'
brew "exa"
# Program that can automate interactive applications
brew "expect"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Image manipulation library
brew "jpeg"
# TIFF library and utilities
brew "libtiff"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like front end for ZSH
brew "fizsh"
# Generic library support script
brew "libtool"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Library for manipulating fonts
brew "fonttools"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Powerful, clean, object-oriented scripting language
brew "ruby"
brew "gem-neovim"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# Update multiple git repositories at once
brew "gitup"
# Alternative to top/htop
brew "glances"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Google Search and News from the command-line
brew "googler"
# Bash tool for navigation to aliased directories with auto-completion
brew "goto"
# Text-mode partitioning tools
brew "gptfdisk"
# GNU grep, egrep and fgrep
brew "grep"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Git dotfiles synchronizer written in bash
brew "homeshick"
# Instant coding answers via the command-line
brew "howdoi"
# <hr />, for your terminal window
brew "hr"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# CLI for ImageOptim, ImageAlpha and JPEGmini
brew "imageoptim-cli"
# Native sequence editor for Git interactive rebase
brew "interactive-rebase-tool"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Modular IRC client
brew "irssi"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interactive environments for writing and running code
brew "jupyter"
# Selection-based modal text editor
brew "kakoune"
# Command-line launcher for macOS, in the spirit of `open`
brew "launch"
# Bash completion for Launchctl
brew "launchctl-completion"
# Manipulate OpenType and multiple-master fonts
brew "lcdf-typetools"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Version of the SSL/TLS protocol forked from OpenSSL
brew "libressl"
# GNOME XML library
brew "libxml2"
# Next-gen compiler infrastructure
brew "llvm"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Package manager for the Lua programming language
brew "luarocks"
# Swiss Army Knife for macOS
brew "m-cli"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Show markdown documents on text terminals
brew "mdcat"
# Command-line based markdown presentation tool
brew "mdp"
# Modern and intuitive terminal-based text editor
brew "micro"
# Dependency manager that installs and runs Swift command-line tool packages
brew "mint"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Powerful paging program
brew "most"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Recreates the SETEC ASTRONOMY effect from 'Sneakers'
brew "no-more-secrets"
# Platform built on V8 to build network applications
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# Open Fortinet client for PPP+SSL VPN tunnel services
brew "openfortivpn"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Pacman for console
brew "pacman4console"
# Highly capable, feature-rich programming language
brew "perl"
# Colored logcat script to show entries only for specified app
brew "pidcat"
# Bash completion for Pip
brew "pip-completion"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Manage compile and link flags for libraries
brew "pkg-config"
# Cowsay but with ponies
brew "ponysay"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Make Python build faster, using the leverage of `ccache`
brew "pyenv-ccache"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Integrate pyenv and system commands
brew "pyenv-which-ext"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Ruby version manager
brew "rbenv"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Command-line Reddit client
brew "rtv"
# Safe, concurrent, practical language
brew "rust"
# Web search from the terminal
brew "s-search"
# Spreadsheet program for the terminal, using ncurses
brew "sc-im"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# StarDict Console Version
brew "sdcv"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Framework and command-line tool for interacting with SourceKit
brew "sourcekitten"
# Sparklines for the shell
brew "spark"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Cross-platform Swift framework templates from the command-line
brew "swiftplate"
# Manipulate and query tags on macOS files
brew "tag"
# Feature-rich console based todo list manager
brew "task"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Official documentation format of the GNU project
brew "texinfo"
# Code-search similar to ack
brew "the_silver_searcher"
# Programatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Google's JavaScript engine
brew "v8"
# Ncurses based file manager with vi like keybindings
brew "vifm"
# Vi 'workalike' with many additional features
brew "vim"
# Use ViM as PAGER
brew "vimpager"
# Terminal-based Tetris clone
brew "vitetris"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# The personal information dashboard for your terminal
brew "wtfutil"
# Xcode version manager
brew "xcenv"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Drop-in replacement for xcodebuild with a few extra features
brew "xctool"
# Cut, copy and paste files with Bash
brew "xcv"
# Python-ish, BASHwards-compatible shell language and command prompt
brew "xonsh"
# Fast CSV toolkit written in Rust
brew "xsv"
# Yet Another JSON Library
brew "yajl"
# Tracks most-used directories to make cd smarter
brew "z"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Zsh curses-based tools, e.g. multi-word history searcher
brew "zsh-navigation-tools"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Organize Your macOS Launchpad Apps.
brew "blacktop/tap/lporg"
brew "git-chglog/git-chglog/git-chglog"
brew "goles/battery/battery"
# Manage your macOS startup items.
brew "hazcod/hazcod/maclaunch"
# macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew "jakehilborn/jakehilborn/displayplacer"
# Bash utility for network and ip geodata, with clean output for piping
brew "jakewmeyer/geo/geo"
# Tiling window manager for macOS based on plugin architecture
brew "koekeishiya/formulae/chunkwm"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# 
brew "metrumresearchgroup/tap/pkgr"
# UNIX's missing `loop` command
brew "miserlou/loop/loop", args: ["HEAD"]
# Scripting with easy zero-conf dependency imports
brew "mxcl/made/swift-sh"
# Copy range of lines from file or stdin to stdout.
brew "nickolasburr/pfa/rng"
# Software environment for statistical computing
brew "sethrfore/r-srf/r", args: ["with-cairo", "with-icu4c", "with-java", "with-libtiff", "with-openblas", "with-texinfo"]
# An automatic updater for ShadowFox
brew "srkomodo/tap/shadowfox-updater"
brew "vapor/tap/vapor"
# Show analytics information for casks in the main taps
brew "vitorgalvao/tiny-scripts/cask-analytics"
# Quickly repair outdated/broken Casks from homebrew-cask
brew "vitorgalvao/tiny-scripts/cask-repair"
# Facilitate installing Linux on a USB stick, from macOS
brew "vitorgalvao/tiny-scripts/linux-usb"
# Get a strong password by leveraging multiple sources
brew "vitorgalvao/tiny-scripts/strongpassword"
brew "woodruffw/screenfetch-c/screenfetch-c"
# karabiner configurator
brew "yqrashawn/goku/goku"
cask "1password"
cask "1password-cli"
cask "adguard"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "appgrid"
cask "balenaetcher"
cask "bartender"
cask "beaker-browser"
cask "brooklyn"
cask "cheatsheet"
cask "clipy"
cask "colorpicker-antetype"
cask "colorpicker-skalacolor"
cask "discord"
cask "dockey"
cask "dotnet"
cask "edex-ui"
cask "etrecheckpro"
cask "expressions"
cask "fastlane"
cask "findergo"
cask "firefox-beta"
cask "flotato"
cask "font-awesome-terminal-fonts"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-firacode-nerd-font"
cask "font-hack-nerd-font"
cask "font-inter"
cask "font-roboto"
cask "font-robotomono-nerd-font"
cask "font-victor-mono"
cask "forticlient"
cask "gb-studio"
cask "geekbench"
cask "gimp"
cask "github"
cask "hammerspoon"
cask "hyper"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "java"
cask "julia"
cask "kap"
cask "karabiner-elements"
cask "keepingyouawake"
cask "key-codes"
cask "keyboard-cleaner"
cask "kitty"
cask "lingon-x"
cask "logitech-options"
cask "macs-fan-control"
cask "marta"
cask "menubar-colors"
cask "microsoft-remote-desktop-beta"
cask "microsoft-teams"
cask "onedrive"
cask "pdf-expert"
cask "penc"
cask "pock"
cask "powershell"
cask "profilecreator"
cask "qlcolorcode"
cask "qutebrowser"
cask "rectangle"
cask "rocket"
cask "rstudio-preview"
cask "sampler"
cask "sf-symbols"
cask "slack"
cask "spaceradar"
cask "sublime-text"
cask "suspicious-package"
cask "swiftdefaultappsprefpane"
cask "taskexplorer"
cask "terminology"
cask "touch-bar-simulator"
cask "tyke"
cask "typora"
cask "ubersicht"
cask "vanilla"
cask "vimr"
cask "vscodium"
cask "workbench"
cask "finestructure/hummingbird/hummingbird"
mas "Cascadea", id: 1432182561
mas "Gifski", id: 1351639930
mas "Magnet", id: 441258766
mas "Nightlight", id: 1429386865
mas "Patterns", id: 429449079
mas "PLIST Editor", id: 1157491961
mas "Source Tools", id: 1419674885
mas "Xcode", id: 497799835
