tap "blacktop/tap"
tap "candid82/brew"
tap "charmbracelet/tap"
tap "danielbayley/changelog"
tap "dnote/dnote"
tap "domt4/vintage"
tap "finestructure/hummingbird"
tap "git-chglog/git-chglog"
tap "goles/battery"
tap "hazcod/hazcod"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/livecheck"
tap "homebrew/services"
tap "isacikgoz/taps"
tap "jakehilborn/jakehilborn"
tap "jakewmeyer/geo"
tap "koekeishiya/formulae"
tap "lautis/refined-github-safari"
tap "lukakerr/things"
tap "mananapr/cfiles"
tap "metrumresearchgroup/tap"
tap "mxcl/made"
tap "nickolasburr/pfa"
tap "nonchalant/appicon"
tap "reitermarkus/tap"
tap "rileytwo/r-srf"
tap "sethrfore/r-srf"
tap "srkomodo/tap"
tap "vapor/tap"
tap "vitorgalvao/tiny-scripts"
cask "xquartz"
brew "ack"
brew "fontconfig"
brew "gettext"
brew "libffi"
brew "openssl@1.1"
brew "readline"
brew "xz"
brew "python"
brew "jpeg"
brew "libtiff"
brew "pixman"
brew "sethrfore/r-srf/cairo"
brew "librsvg"
brew "ansible"
brew "antibody"
brew "boost"
brew "gcc"
brew "openblas"
brew "apache-arrow"
brew "apache-arrow-glib"
brew "archey"
brew "libssh2"
brew "aria2"
brew "asciidoc"
brew "aspell"
brew "automake"
brew "axel"
brew "bar"
brew "bash"
brew "bash-completion@2"
brew "bashdb"
brew "bat"
brew "bench"
brew "bitrise"
brew "brew-cask-completion"
brew "brew-gem"
brew "browser"
brew "bwm-ng"
brew "ghc"
brew "cabal-install"
brew "cargo-completion"
brew "carthage"
brew "ccache"
brew "ccat"
brew "cheat"
brew "clean"
brew "clib"
brew "cmake"
brew "cocoapods"
brew "cointop"
brew "colormake"
brew "composer"
brew "coreutils"
brew "cowsay"
brew "cryptopp"
brew "csvkit"
brew "dash"
brew "ddgr"
brew "dialog"
brew "diff-so-fancy"
brew "diffutils"
brew "diskus"
brew "duti"
brew "elvish"
brew "emojify"
brew "entr"
brew "exa"
brew "excel-compare"
brew "expect"
brew "fd"
brew "fdupes"
brew "openjpeg"
brew "ffmpeg"
brew "figlet"
brew "fileicon"
brew "findutils"
brew "fish"
brew "zsh"
brew "fizsh"
brew "fonttools"
brew "fortune"
brew "fzf", args: ["HEAD"]
brew "fzy"
brew "gawk"
brew "geos"
brew "libxml2"
brew "proj"
brew "libtool"
brew "nss"
brew "qt"
brew "gdal"
brew "gibo"
brew "ninja"
brew "pkg-config"
brew "gist"
brew "git"
brew "gnu-getopt"
brew "git-flow-avh"
brew "git-open"
brew "gitleaks"
brew "gitup"
brew "glances"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "googler"
brew "goto"
brew "gptfdisk"
brew "grep"
brew "gsl"
brew "lua"
brew "highlight"
brew "homeshick"
brew "howdoi"
brew "hr"
brew "htop"
brew "httpie"
brew "hub"
brew "hugo"
brew "hyperfine"
brew "libheif"
brew "imagemagick"
brew "imageoptim-cli"
brew "interactive-rebase-tool"
brew "iproute2mac"
brew "irssi"
brew "jq"
brew "jrnl"
brew "node"
brew "pandoc"
brew "jupyterlab"
brew "kakoune"
brew "known_hosts"
brew "launch"
brew "launchctl-completion"
brew "lcdf-typetools"
brew "libgit2"
brew "libimobiledevice"
brew "liblwgeom"
brew "libressl"
brew "libsvg"
brew "llvm"
brew "lolcat"
brew "loop", args: ["HEAD"]
brew "lsd"
brew "luarocks"
brew "luvit"
brew "m-cli"
brew "make"
brew "mas"
brew "mdcat"
brew "mdp"
brew "micro"
brew "mint"
brew "mkcert"
brew "mkl-dnn"
brew "monit"
brew "moreutils"
brew "most"
brew "mycli"
brew "nativefier"
brew "ncdu"
brew "neofetch", args: ["HEAD"]
brew "neovim"
brew "nmap"
brew "nnn"
brew "no-more-secrets"
brew "noti"
brew "onefetch"
brew "open-completion"
brew "open-mpi"
brew "openfortivpn"
brew "osx-cpu-temp"
brew "p7zip"
brew "pacman4console"
brew "perl"
brew "pidcat"
brew "pip-completion"
brew "pipes-sh"
brew "ponysay"
brew "proctools"
brew "pv"
brew "pyinvoke", args: ["HEAD"]
brew "python@2"
brew "qtkeychain"
brew "rbenv"
brew "rdesktop"
brew "reattach-to-user-namespace"
brew "rename"
brew "ripgrep"
brew "rmlint"
brew "rtv"
brew "ruby"
brew "rust"
brew "s-search"
brew "sc-im"
brew "screenfetch"
brew "screenfetch-c"
brew "sdcv"
brew "shellcheck"
brew "shfmt"
brew "sl"
brew "sourcery"
brew "spark"
brew "speedtest-cli"
brew "swiftformat"
brew "swiftlint"
brew "swiftplate"
brew "sysbench"
brew "tag"
brew "task"
brew "tcl-tk"
brew "telnet"
brew "terminal-notifier"
brew "texinfo"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tmux"
brew "tox"
brew "trash"
brew "tree"
brew "udunits"
brew "v8"
brew "vifm"
brew "vim"
brew "vimpager"
brew "vitetris"
brew "w3m"
brew "wget"
brew "wifi-password"
brew "wtf"
brew "wtfutil"
brew "xcenv"
brew "xcodegen"
brew "xcproj"
brew "xctool"
brew "xcv"
brew "xhyve"
brew "xonsh"
brew "xsv"
brew "xtensor"
brew "yajl"
brew "youtube-dl"
brew "z"
brew "zathura"
brew "zpython"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-navigation-tools"
brew "zsh-syntax-highlighting"
brew "blacktop/tap/lporg"
brew "charmbracelet/tap/glow"
brew "dnote/dnote/dnote"
brew "git-chglog/git-chglog/git-chglog"
brew "goles/battery/battery"
brew "hazcod/hazcod/maclaunch"
brew "isacikgoz/taps/tldr"
brew "jakehilborn/jakehilborn/displayplacer"
brew "jakewmeyer/geo/geo"
brew "metrumresearchgroup/tap/pkgr"
brew "mxcl/made/swift-sh"
brew "nickolasburr/pfa/rng"
brew "nonchalant/appicon/appicon"
brew "reitermarkus/tap/lockscreen"
brew "rileytwo/r-srf/r", args: ["with-cairo", "with-icu4c", "with-java", "with-libtiff", "with-openblas", "with-texinfo"]
brew "srkomodo/tap/shadowfox-updater"
brew "vapor/tap/vapor"
brew "vitorgalvao/tiny-scripts/cask-analytics"
brew "vitorgalvao/tiny-scripts/cask-repair"
brew "vitorgalvao/tiny-scripts/linux-usb"
brew "vitorgalvao/tiny-scripts/strongpassword"
cask "1password"
cask "adguard"
cask "alfred"
cask "amethyst"
cask "bettertouchtool"
cask "brave-browser-beta"
cask "brooklyn"
cask "discord"
cask "dockey"
cask "firefox-beta"
cask "font-awesome-terminal-fonts"
cask "font-cascadia"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-firacode-nerd-font"
cask "font-fontawesome"
cask "font-gentium-plus"
cask "font-hack-nerd-font"
cask "font-nunito"
cask "font-victor-mono"
cask "fork"
cask "geekbench"
cask "github-beta"
cask "hammerspoon"
cask "haptic-touch-bar"
cask "haptickey"
cask "hummingbird"
cask "iina"
cask "iterm2"
cask "itsycal"
cask "java"
cask "karabiner-elements"
cask "kindle"
cask "logitech-unifying"
cask "macs-fan-control"
cask "menubar-stats"
cask "microsoft-office"
cask "microsoft-remote-desktop-beta"
cask "netnewswire"
cask "novabench"
cask "onyx"
cask "pine"
cask "powershell"
cask "pusher"
cask "refined-github-safari"
cask "rstudio-preview"
cask "sampler"
cask "scroll-reverser"
cask "sf-symbols"
cask "sourcetree"
cask "tableau-public"
cask "tableau-reader"
cask "telegram"
cask "textmate"
cask "tyke"
cask "vimr"
cask "vscodium"
mas "ColorSlurp", id: 1287239339
mas "com.donewithcomputers.winston", id: 1161123070
mas "Copy Right", id: 1391114129
mas "Dark Mode for Safari", id: 1397180934
mas "Dark Reader for Safari", id: 1438243180
mas "Filters for Photos", id: 1083965373
mas "Gifski", id: 1351639930
mas "HEIC Converter", id: 1294126402
mas "Lens Studio", id: 1391221278
mas "Magnet", id: 441258766
mas "Nightlight", id: 1429386865
mas "Patterns", id: 429449079
mas "PhotoScape X", id: 929507092
mas "PLIST Editor", id: 1157491961
mas "Polarr Photo Editor", id: 1077124956
mas "Transporter", id: 1450874784
mas "Twitter", id: 1482454543
